{
  "</amount>": 57542,
  "</date>": 57528,
  "</description>": 57536,
  "</item>": 57534,
  "</line_items>": 57532,
  "</quantity>": 57538,
  "</total>": 57530,
  "</unit_price>": 57540,
  "</vendor>": 57526,
  "<amount>": 57541,
  "<date>": 57527,
  "<description>": 57535,
  "<item>": 57533,
  "<line_items>": 57531,
  "<quantity>": 57537,
  "<s_iitcdip>": 57523,
  "<s_synthdog>": 57524,
  "<sep/>": 57522,
  "<total>": 57529,
  "<unit_price>": 57539,
  "<vendor>": 57525
}
